# Datos del Titanic

In [1]:
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
import numpy as np
import pandas as pd

In [5]:
titanic["survived"] = pd.Categorical(titanic["survived"])

In [6]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [7]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [14]:
titanic['deck'] = pd.Categorical(titanic['deck'])

## Tablas de contingencia de una variable

In [23]:
tab_s = pd.crosstab(index = titanic['survived'],
                 columns = 'pasajeros')
tab_s ## Frecuencias absoluta

col_0     pasajeros
survived
0               549
1               342

In [9]:
type(tab)

pandas.core.frame.DataFrame

In [24]:
tab_p =pd.crosstab(index = titanic['pclass'],
           columns = 'pasajeros')
tab_p

col_0   pasajeros
pclass
1             216
2             184
3             491

In [26]:
tab_sex = pd.crosstab(index = titanic['sex'],
           columns = 'pasajeros')
tab_sex

col_0   pasajeros
sex
female        314
male          577

In [16]:
tab_c = pd.crosstab(index = titanic['deck'],
           columns = 'Count')

tab_c

col_0  Count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [17]:
tab_c.sum()

col_0
Count    203
dtype: int64

In [19]:
tab_c.shape

(7, 1)

In [20]:
tab_c.iloc[1:5]

col_0  Count
deck
B         47
C         59
D         33
E         32

# Frecuencias Relativas

In [21]:
tab_c/tab_c.sum()

col_0     Count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [27]:
tab_p/tab_p.sum()

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

In [28]:
tab_s/tab_s.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

In [29]:
tab_sex/tab_sex.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

# Tablas De Contingencia de dos Variables

In [31]:
survived_sex = pd.crosstab(index = titanic['survived'],
                         columns = titanic['sex'])
survived_sex.index = ['died','survived']
survived_sex

sex       female  male
died          81   468
survived     233   109

In [35]:
survived_class = pd.crosstab(index = titanic['survived'],
                            columns = titanic['pclass'],
                            margins = True)

survived_class.index = ['Murio','Sobrevivio','Total_clase']
survived_class.columns = ['Primera',"Segunda","Tercera","Total_supervi"]
survived_class

             Primera  Segunda  Tercera  Total_supervi
Murio             80       97      372            549
Sobrevivio       136       87      119            342
Total_clase      216      184      491            891

# Frecuencias Relativas globales

In [36]:
survived_class/titanic.shape[0] ## dividir entre el total de individuos

              Primera   Segunda   Tercera  Total_supervi
Murio        0.089787  0.108866  0.417508       0.616162
Sobrevivio   0.152637  0.097643  0.133558       0.383838
Total_clase  0.242424  0.206510  0.551066       1.000000

# Frecuencias Relativas marginales

In [37]:
survived_class/survived_class.loc['Total_clase']

             Primera   Segunda   Tercera  Total_supervi
Murio        0.37037  0.527174  0.757637       0.616162
Sobrevivio   0.62963  0.472826  0.242363       0.383838
Total_clase  1.00000  1.000000  1.000000       1.000000

In [42]:
survived_class.T/survived_class['Total_supervi']

                  Murio  Sobrevivio  Total_clase
Primera        0.145719    0.397661     0.242424
Segunda        0.176685    0.254386     0.206510
Tercera        0.677596    0.347953     0.551066
Total_supervi  1.000000    1.000000     1.000000

In [43]:
survived_class.div(survived_class['Total_supervi'], axis=0)

              Primera   Segunda   Tercera  Total_supervi
Murio        0.145719  0.176685  0.677596            1.0
Sobrevivio   0.397661  0.254386  0.347953            1.0
Total_clase  0.242424  0.206510  0.551066            1.0

# Tablas Multidimensionales

In [44]:
surv_sex_class = pd.crosstab(index = titanic['survived'],
                            columns = [titanic['sex'], titanic['pclass']],
                            margins= True)
surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [45]:
surv_sex_class['female']

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [46]:
surv_sex_class['female'][1]

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [50]:
surv_sex_class/surv_sex_class.loc['All']

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000